experimental/glm52_b300_fixed_seq/results/c2-three-arm-dp-mem80-20260920/runs/c2-w4a16-megamoe-mem80-20260920/1k1k/w4a16-megamoe/tp4_conc32/benchmark.log
+ run_server_client env PYTHONPATH=/data/home/ziangli/inferencex-glm52-b300/sources/inferencex-mem80-20260920:/data/home/ziangli/inferencex-glm52-b300/sources/sglang/python:/data/home/ziangli/inferencex-glm52-b300/sources/flashinfer-ad0a5e5e:/data/home/ziangli/inferencex-glm52-b300/sources/inferencex-mem80-20260920 python3 -m infx.bench_serving.benchmark_serving --model nvidia/GLM-5.2-NVFP4 --backend vllm --base-url http://0.0.0.0:30000 --dataset-name random --random-input-len 1024 --random-output-len 1024 --random-range-ratio 0.8 --num-prompts 320 --max-concurrency 32 --request-rate inf --ignore-eos --save-result --num-warmups 64 --percentile-metrics ttft,tpot,itl,e2el --result-dir /data/home/ziangli/inferencex-glm52-b300/results/c2-w4a16-megamoe-mem80-20260920/1k1k/w4a16-megamoe/tp4_conc32 --result-filename result.json --use-chat-template --tokenizer /data/home/ziangli/inferencex-glm52-b300/checkpoints/GLM-5.2-NVFP4
+ [[ -n /tmp/inferencex-server-state.u73M6T ]]
+ PYTHONPATH=/data/home/ziangli/inferencex-glm52-b300/sources/inferencex-mem80-20260920:/data/home/ziangli/inferencex-glm52-b300/sources/sglang/python:/data/home/ziangli/inferencex-glm52-b300/sources/flashinfer-ad0a5e5e:/data/home/ziangli/inferencex-glm52-b300/sources/inferencex-mem80-20260920
+ python3 -m infx.bench_serving.server_watch run --state /tmp/inferencex-server-state.u73M6T -- env PYTHONPATH=/data/home/ziangli/inferencex-glm52-b300/sources/inferencex-mem80-20260920:/data/home/ziangli/inferencex-glm52-b300/sources/sglang/python:/data/home/ziangli/inferencex-glm52-b300/sources/flashinfer-ad0a5e5e:/data/home/ziangli/inferencex-glm52-b300/sources/inferencex-mem80-20260920 python3 -m infx.bench_serving.benchmark_serving --model nvidia/GLM-5.2-NVFP4 --backend vllm --base-url http://0.0.0.0:30000 --dataset-name random --random-input-len 1024 --random-output-len 1024 --random-range-ratio 0.8 --num-prompts 320 --max-concurrency 32 --request-rate inf --ignore-eos --save-result --num-warmups 64 --percentile-metrics ttft,tpot,itl,e2el --result-dir /data/home/ziangli/inferencex-glm52-b300/results/c2-w4a16-megamoe-mem80-20260920/1k1k/w4a16-megamoe/tp4_conc32 --result-filename result.json --use-chat-template --tokenizer /data/home/ziangli/inferencex-glm52-b300/checkpoints/GLM-5.2-NVFP4
Namespace(backend='vllm', base_url='http://0.0.0.0:30000', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=32, model='nvidia/GLM-5.2-NVFP4', tokenizer='/data/home/ziangli/inferencex-glm52-b300/checkpoints/GLM-5.2-NVFP4', best_of=1, use_beam_search=False, num_prompts=320, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=False, metadata=None, result_dir='/data/home/ziangli/inferencex-glm52-b300/results/c2-w4a16-megamoe-mem80-20260920/1k1k/w4a16-megamoe/tp4_conc32', result_filename='result.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='90,99,99.9', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.8, random_prefix_len=0, use_chat_template=True, random_num_workers=0, dsv4=False, hf_subset=None, hf_split=None, hf_output_len=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, num_warmups=64)
Generating 320 prompts using 8 worker processes...
Prompt generation completed in 3.8s
-------------------  Input/Output Length Statistics  -------------------
 input_lens : min=821   max=1024  mean=921.09   avg_token_mismatch=12.00 
 output_lens: min=819   max=1024  mean=924.23  
------------------------------------------------------------------------ 

Starting initial single prompt test run...
Warming up with 64 requests...
100%|██████████| 64/64 [00:24<00:00,  2.65it/s]
Warmup completed.
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 32
  0%|          | 0/320 [00:00<?, ?it/s]Starting main benchmark run...
100%|██████████| 320/320 [02:20<00:00,  2.28it/s]
============ Serving Benchmark Result ============
Successful requests:                     320       
Benchmark duration (s):                  140.47    
Total input tokens:                      294748    
Total generated tokens:                  295754    
Request throughput (req/s):              2.28      
Output token throughput (tok/s):         2105.45   
Total Token throughput (tok/s):          4203.73   
---------------Time to First Token----------------
Mean TTFT (ms):                          635.11    
Median TTFT (ms):                        301.53    
P90 TTFT (ms):                           1488.08   
P99 TTFT (ms):                           2667.78   
P99.9 TTFT (ms):                         3423.62   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          13.94     
Median TPOT (ms):                        14.02     
P90 TPOT (ms):                           15.73     
P99 TPOT (ms):                           16.84     
P99.9 TPOT (ms):                         17.81     
---------------Inter-token Latency----------------
Mean ITL (ms):                           1152.02   
Median ITL (ms):                         844.36    
P90 ITL (ms):                            2441.58   
P99 ITL (ms):                            4542.00   
P99.9 ITL (ms):                          6557.04   
----------------End-to-end Latency----------------
Mean E2EL (ms):                          13501.78  
Median E2EL (ms):                        13484.45  
P90 E2EL (ms):                           15955.53  
P99 E2EL (ms):                           17097.91  
P99.9 E2EL (ms):                         17371.98  
==================================================
+ set +x